// C06_If1.c
// 여기선 IF만 하루종일 함
#include <stdio.h>
int main(){
    // if(조건식){ 맞을때 } 아니면? 안넣어도 됨.
    // if(조건식){맞을때}else{틀릴때}
    // 조건식 : true/false : 0아닌놈/0
    // >= <= > < == != && ||
    // -------------------------------------
    // 여러분 통장잔액 입력.
    // 1만원 이상이면 순대국밥, 아니면 컵라면출력
    int balance=9000;
    if(balance>=10000){   // 이 맞다면~~~ 여기 시랳ㅇ
        printf("순대국밥\n");// Sundae Gukbap
    }else{
        printf("컵라면 ㅠㅠㅠ\n");// Cup ramen
    }
    // -----------------------------------------
    int korea = 3;
    int japan = 2;
    // 만약 한국이 득점이 더 높으면 "승리" 아니면
    // 패배 ㅠㅠ 를 출력하세요
    if(korea>japan)
    {
        printf("승리\n");
    }
    else
    {
        printf("패배 ㅠㅠ\n");
    }

    // 근데 이걸 삼항 연산자도 곁들여서....는 제가!
    korea>japan ? printf("승리\n") : printf("패\n");
    /// ---------------------------------------------
    // 아래와 같은 질문을 통해 다른 결과를 출력하세요
    int question = 0;
    printf("나 사랑해? : ");
    scanf("%d", &question);
    if(question != 0){
        printf("나도 사랑해 고마워\n");
    }
    else{
        // 사랑하지 않는다고 대답한 경우.....
        printf("진짜로 나 안사랑해? : ");
        scanf("%d",&question);
        if(question != 0){
            // 사랑한다고 했음...
            printf("놀랬잖아. 나도 사랑해\n");
        }
        else{
            printf("ㅗ 산을 표현한 수화야\n");
        }
    }
    // -------------------------------------------
    // 마라탕(1)     //마라샹궈(0)
    // 맵기(맵게1,안맵게0) 각각 설정 필요
    // 주문하신 마라탕 맵게 나왔슴다.
    int type = 0;
    printf("마라탕 1, 샹궈 0 : ");
    scanf("%d", &type);
    if(type == 1){   // 여기는 마라탕
        int spicy = 0;
        printf("마라탕 맵게?? : ");
        scanf("%d", &spicy);
        if(spicy==1){
            printf("마라탕 맵게 나왔슴다\n");
        }
        else{
            printf("마라탕 안맵게 나왔슴다\n");
        }
    }else{   // 여기는 마라샹궈
        int spicy = 0;
        printf("마라샹궈 맵게?? : ");
        scanf("%d", &spicy);
        if(spicy==1){
            printf("마라샹궈 맵게 나왔슴다\n");
        }else{
            printf("마라샹궈 안맵게 나왔슴다\n");
        }
    }
    // --------------------------------------------------
    // 1 짜장 2짬뽕 3볶믐밥 4탕수육 ?: X
    // 1 -> 그냥, 간
    // 2 -> 맵게 안뱁게
    // 3 -> 새우, 게살
    int choice = 0;
    printf("짜장1, 짬뽕2, 볶3, 탕4 : ");
    scanf("%d",&choice);
    if(choice==1){
        int type2 = 0;
        printf("Normal? SPecial? : ");
        scanf("%d",&type2);
        if(type2==0){
            printf("그냥짜장\n");
        }
        else{
            printf("간짜장1\n");
        }
    }
    else{
        if(choice == 2){
            printf("짬뽕\n");
        }
        else{
            if(choice == 3){
                printf("볶음밥\n");
            }
            else{
                if(choice == 4){
                    printf("탕수육\n");
                }
                else{
                    printf("X\n");
                }
            }
        }
    }
    
    // ------------------------------------------
    // 성적이 90이상이면 A 90이상이 아니라면, 80이상이면
    // B, 80이상이 아니라면 70이상이면 C, 아니라면 60이상
    // 이면 D, 50이상이면 E, 이것도 아니라면 F
    int score = 98;
    if(score>=90){
        printf("A\n");
    }else{
        if(score>=80){
            printf("B\n");
        }else{
            if(score>=70){
                printf("C\n");
            }else{
                if(score>=60){
                    printf("D\n");
                }else{
                    if(score>=50){
                        printf("E\n");
                    }else{
                        printf("F\n");
                    }
                }
            }
        }
    }








} // ==============================================
// ================================================
// ================================================
// ================================================
// ================================================
// ================================================
// ================================================
// ================================================
// ================================================
// ================================================
// ================================================
// ================================================
// ================================================
// ================================================
// ================================================
// ================================================
// ================================================